#!/bin/bash
sed 's/a1/１Ａ　現代世界への歴史学的アプロ｜チ/g' |
sed 's/b1/１Ｂ　グロ｜バル時代の政治経済学　　/g' |
sed 's/c1/１Ｃ　グロ｜バル時代の社会学　　　　/g' |
sed 's/d1/１Ｄ　ケ｜ススタディによる応用倫理学/g' |
sed 's/e1/１Ｅ　地球生物圏と人間　　　　　　　/g' |
sed 's/a2/２Ａ　哲学︵自我論︶　　　　　　　　/g' |
sed 's/b2/２Ｂ　パ｜ソナリティ心理学　　　　　/g' |
sed 's/c2/２Ｃ　グローバル時代の文学　　　　　/g' |
sed 's/d2/２Ｄ　健康科学　　　　　　　　　　　/g' |
sed 's/e2/２Ｅ　細胞・分子生物学　　　　　　　/g' |
sed 's/f2/２Ｆ　エクササイズ＆スポ｜ツ実技　　/g' |
sed 's/b3/３Ｂ　クリティカル・シンキング　　　/g' |
sed 's/c3/３Ｃ　価値と情動の認知科学　　　　　/g' |
sed 's/e3/３Ｅ　芸術と自己表現　　　　　　　　/g' |
sed 's/f3/３Ｆ　スポ｜ツ科学　　　　　　　　　/g' |
sed 's/a4/４Ａ　地域社会と文化人類学　　　　　/g' |
sed 's/b4/４Ｂ　日本史・日本文化　　　　　　　/g' |
sed 's/c4/４Ｃ　異文化間コミュニケ｜ション　　/g' |
sed 's/d4/４Ｄ　異文化体験　　　　　　　　　　/g' |
sed 's/e4/４Ｅ　グロ｜バル時代の国際協力　　　/g' |
sed 's/f4/４Ｆ　グロ｜バル社会と地域の課題　　/g' |
sed 's/a5/５Ａ　科学技術と科学方法論　　　　　/g' |
sed 's/b5/５Ｂ　統計学から未来を見る　　　　　/g' |
sed 's/d5/５Ｄ　環境学とＥＳＤ　　　　　　　　/g' |
sed 's/e5/５Ｅ　生活と社会保障　　　　　　　　/g' |
sed 's/f5/５Ｆ　現代社会と人権　　　　　　　　/g' |
sed 's/a6/６Ａ　インテグレ｜テッド科学　　　　/g' |
sed 's/b6/６Ｂ　ＡＩ入門　　　　　　　　　　　/g' |
sed 's/c6/６Ｃ　情報の科学　　　　　　　　　　/g' |
sed 's/d6/６Ｄ　デザイン思考入門　　　　　　　/g' |
sed 's/e6/６Ｅ　論理学と数学の基礎　　　　　　/g' |
sed 's/ch/基礎　化学　　　　　　　　　　　　　/g' |
sed 's/ph/基礎　物理学　　　　　　　　　　　　/g' |
sed 's/la/基礎　線形代数学　　　　　　　　　　/g' |
sed 's/ig/基礎　微分積分学　　　　　　　　　　/g' |
sed 's/to/言語　ＴＯＥＩＣ準備　　　　　　　　/g' |
sed 's/ea/言語　ＥＡＰ　　　　　　　　　　　　/g' |
sed 's/ng/　　　不可　　　　　　　　　　　　　/g'

exit